{"modelTopology":{"class_name":"Model","config":{"name":"model_2","layers":[{"name":"input_2","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input_2"},"inbound_nodes":[]},{"name":"dense_4","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_4","trainable":true},"inbound_nodes":[[["input_2",0,0,{}]]]},{"name":"dense_5","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_5","trainable":true},"inbound_nodes":[[["dense_4",0,0,{}]]]},{"name":"dense_6","class_name":"Dense","config":{"units":38804,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_6","trainable":true},"inbound_nodes":[[["dense_5",0,0,{}]]]},{"name":"reshape_2","class_name":"Reshape","config":{"target_shape":[218,178],"name":"reshape_2","trainable":true},"inbound_nodes":[[["dense_6",0,0,{}]]]}],"input_layers":[["input_2",0,0]],"output_layers":[["reshape_2",0,0]]},"keras_version":"tfjs-layers 0.10.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./my-model.weights.bin"],"weights":[{"name":"dense_4/kernel","shape":[2,128],"dtype":"float32"},{"name":"dense_4/bias","shape":[128],"dtype":"float32"},{"name":"dense_5/kernel","shape":[128,128],"dtype":"float32"},{"name":"dense_5/bias","shape":[128],"dtype":"float32"},{"name":"dense_6/kernel","shape":[128,38804],"dtype":"float32"},{"name":"dense_6/bias","shape":[38804],"dtype":"float32"}]}]}